//
//  main.cpp
//  Lab#4
//
//  Created by Sasha Humeniuk on 10/27/21.
//

#include <iostream>
#include <cmath>

using namespace std;

int main() {
    float e = 0.0001; // Ініціалізації змінної e (точність) 0.0001 = 10^(-4)
    
    float x;
    cout << "Input x: ";
    cin >> x; // Оголошення та введення значення x
    
    int n = 0; // Ініціалізація змінної k (порядковий номер члена послідовності)
    float sum = 0; // Ініціалізації змінної sum (сума)
    float a;    // Оголошення змінної a (поточний член послідовності)
    
    do{
        ++n; // Збільшення порядкового номера на 1
        a = x/(sqrt(n)*(n+2)); // Обчислення значення поточного члена послідовнрсті
        sum += a; // Додавання значення поточного члена до суми
    }
    while (!(n > 10 && abs(a) < e)); // Умова ітераційного цикли з постумовою
    
    
    cout << "The sum is: " << sum << endl; //Виведення значення суми
}
