#include <iostream>

using namespace std;

int main() {
    int n;
    cout << "Input your n: ";
    cin >> n; // Введення значення n
    
    double x1 = 1; // Ініціалізація першого члена за умовою
    double x2 = 0.3; // Ініціалізація другого члена за умовою
    
    cout << "x1\t"<< x1 << endl; // Виведення першого члена (завжди n >= 1)
    
    if (n > 1){
        cout << "x2\t"<<x2 << endl; // Якщо n > 1 - виведення другого члена
    }
    
    double x3; // Оголошення змінної третього члена
    for (int i = 3; i <= n; i++){ //Арифметичний цикл з i від 3 до n
        
        x3 = (i+1)*x1;  //Знаходження наступного третього члена
        
        cout <<"x"<< i << "\t" << x3 << endl; // Виведення цього члена
        
        x1 = x2;
        x2 = x3; // Заміщення трьох членів, яки ми розглядаємо назад на 1
    }
    
    return 0;
}
